blogs/grep-command-examples.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>grep command examples</title>
<!-- 2015-09-27 日 13:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="SATHIYAMOORTHY,zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">grep command examples</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 在文件中查找指定的字符串，可以一次在多个文件查找</a></li>
<li><a href="#sec-2">2. <code>-i</code> 忽略大小写</a></li>
<li><a href="#sec-3">3. 使用正则表达式</a>
<ul>
<li><a href="#sec-3-1">3.1. 使用锚点</a></li>
<li><a href="#sec-3-2">3.2. 使用通配符</a></li>
<li><a href="#sec-3-3">3.3. 重复次数</a></li>
<li><a href="#sec-3-4">3.4. 查找th开头，后跟2个字符的行</a></li>
</ul>
</li>
<li><a href="#sec-4">4. <code>-w</code> 匹配完整的单词</a></li>
<li><a href="#sec-5">5. <code>-B</code> 显示匹配行的前几行， <code>-A</code> 显示后几行， <code>-C</code> 显示前后几行</a></li>
<li><a href="#sec-6">6. <code>--color</code> 高亮现实匹配到的字符串</a></li>
<li><a href="#sec-7">7. 其它很有用的选项</a></li>
<li><a href="#sec-8">8. <b>egrep</b> <b>fgrep</b> </a></li>
</ul>
</div>
</div>
<p>
本文部分摘译自<a href="http://www.thegeekstuff.com/2009/03/15-practical-unix-grep-command-examples/">15 Practical Grep Command Examples In Linux / UNIX</a>
</p>

<p>
本文使用下面的文件作为 <code>grep</code> 的对象。
</p>

<div class="org-src-container">

<pre class="src src-bash">$ cat demo_file
THIS LINE IS THE 1ST UPPER CASE LINE IN THIS FILE.
this line is the 1st lower case line in this file.
This Line Has All Its First Character Of The Word With Upper Case.

Two lines above this line is empty.
And this is the last line.
</pre>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 在文件中查找指定的字符串，可以一次在多个文件查找</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-bash">$ cp demo_file demo_file2
$ echo grep "Character" demo*
grep Character demo_file demo_file2
$ grep "Character" demo*
demo_file:This Line Has All Its First Character Of The Word With Upper Case.
demo_file2:This Line Has All Its First Character Of The Word With Upper Case.
</pre>
</div>

<p>
如 <b>echo</b> 显示的，这里是 <b>$SHELL</b> 自身把 <b><code>demo*</code></b>  解析成两个文件，grep看到的还是两个文件
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <code>-i</code> 忽略大小写</h2>
<div class="outline-text-2" id="text-2">
<p>
grep默认是大小写区分的，通过 <code>-i</code> 可以忽略大小写
</p>

<div class="org-src-container">

<pre class="src src-bash">$ grep the demo_file
this line is the 1st lower case line in this file.
And this is the last line.
$ grep -i the demo_file
THIS LINE IS THE 1ST UPPER CASE LINE IN THIS FILE.
this line is the 1st lower case line in this file.
This Line Has All Its First Character Of The Word With Upper Case.
And this is the last line.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 使用正则表达式</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 使用锚点</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><code>^</code> ：必须出现在行首
</li>
<li><code>$</code> ：必须出现在行尾
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 使用通配符</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><code>.</code> ：匹配任意字符
</li>
<li><code>[abc149]</code> ：匹配[]里的任意字符
</li>
<li><code>[a-c14-9]</code> ：同上
</li>
<li><code>[:digit:]</code> ：同[0-9]
</li>
<li><code>[:alnum:]</code> ：同[0-9A-Za-z]
</li>
<li><code>[:alpha:]</code> ：同[A-Za-z]
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 重复次数</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><code>?</code>     ：匹配0次或1次
</li>
<li><code>*</code>     ：匹配任意次
</li>
<li><code>+</code>     ：匹配至少1次
</li>
<li><code>{n}</code>   ：匹配n次
</li>
<li><code>{n,}</code>  ：匹配至少n次
</li>
<li><code>{,m}</code>  ：最多匹配m次
</li>
<li><code>{n,m}</code> ：匹配n次到m次之间
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 查找th开头，后跟2个字符的行</h3>
<div class="outline-text-3" id="text-3-4">
<p>
主意grep和egrep的差别<a href="#egrep-fgrep">8</a>
</p>
<div class="org-src-container">

<pre class="src src-sh">$ grep <span style="color: #00ff00;">'th[a-z]\{2\}'</span> demo_file
this line is the 1st lower case line<span style="color: #00ffff; font-weight: bold;"> in</span> this file.
Two lines above this line is empty.
And this is the last line.
$ egrep <span style="color: #00ff00;">'th[a-z]{2}'</span> demo_file
this line is the 1st lower case line<span style="color: #00ffff; font-weight: bold;"> in</span> this file.
Two lines above this line is empty.
And this is the last line.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <code>-w</code> 匹配完整的单词</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-bash">$ grep is demo_file
this line is the 1st lower case line in this file.
This Line Has All Its First Character Of The Word With Upper Case.
Two lines above this line is empty.
And this is the last line.
$ grep -w is demo_file
this line is the 1st lower case line in this file.
Two lines above this line is empty.
And this is the last line.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <code>-B</code> 显示匹配行的前几行， <code>-A</code> 显示后几行， <code>-C</code> 显示前后几行</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-bash">$ grep -B 2 empty demo_file
This Line Has All Its First Character Of The Word With Upper Case.

Two lines above this line is empty.
$ grep -A 1 empty demo_file
Two lines above this line is empty.
And this is the last line.
$ grep -C 3 empty demo_file
this line is the 1st lower case line in this file.
This Line Has All Its First Character Of The Word With Upper Case.

Two lines above this line is empty.
And this is the last line.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <code>--color</code> 高亮现实匹配到的字符串</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-bash">$ grep --color=always empty demo_file
Two lines above this line is empty.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 其它很有用的选项</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><code>-r</code> ：递归查找
</li>
<li><code>-n</code> ：显示行号
</li>
<li><code>-c</code> ：只显示匹配了多少次
</li>
<li><code>-o</code> ：只显示匹配到的内容（默认是匹配到的行）
</li>
<li><code>-l</code> ：只显示匹配到的文件
</li>
<li><code>-v</code> ：只显示不匹配的
</li>
<li><code>-q</code> ：关闭输出，通过 <code>$?</code> 判断是否匹配成功
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <b>egrep</b> <b>fgrep</b> <a id="egrep-fgrep" name="egrep-fgrep"></a></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><b>egrep</b> 相当于 <code>grep -E</code> ，?， +， {， |， (， )，不需要转义
</li>
<li><b>fgrep</b> 相当于 <code>grep -F</code> ，关闭正则匹配
</li>
<li><code>grep -P</code> 使用perl正则表达式
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: SATHIYAMOORTHY,zhengzhiyong</p>
<p class="date">Created: 2015-09-27 日 13:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
